In [58]:
# Import necessary libraries
import pandas as pd
from sqlalchemy import create_engine

# Create a database connection engine
# This connects to a MySQL database named 'application' running on localhost
# with username 'pandas_user' and password 'pandas123'
engine = create_engine(
    "mysql+pymysql://pandas_user:pandas123@localhost:3306/application"
)

# Read the 'customers' table from the database into a pandas DataFrame
df = pd.read_sql("customers", engine)
# Display the DataFrame
df

   id    name  phone_number
0   1  Donald    7326784567
1   2    Bill    6573489999
2   3    Modi    4567895646

In [59]:
# Read data from the 'customers' table in the database
# Only select the 'name' column from the table
# The connection to the database is through the 'engine' object
df = pd.read_sql("customers", engine)
# Display the dataframe containing customer names
df

   id    name  phone_number
0   1  Donald    7326784567
1   2    Bill    6573489999
2   3    Modi    4567895646

In [60]:
# SQL query to join customers and orders tables
# Selects customer name, phone number, order name, and amount
# Uses INNER JOIN to match customers with their orders based on customer ID
q = ''' SELECT customers.name, customers.phone_number, orders.name, orders.amount
FROM customers INNER JOIN orders
ON 
customers.id=orders.customer_id;'''

# Execute the SQL query and store results in a pandas DataFrame
df = pd.read_sql_query(q,engine)

# Display the resulting DataFrame with joined customer and order information
inner

     name  phone_number          name  amount
0    Bill    6573489999      Yoga Mat      20
1  Donald    7326784567  Google Pixel     950
2    Modi    4567895646  Fossil Watch     120

In [76]:
df = pd.read_csv("/Users/rohankondhalkar/Desktop/Pandas/customers.csv")
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [80]:
# Rename columns in the DataFrame for better readability and consistency
# 'Customer Name' becomes 'name' and 'Customer Phone' becomes 'phone'
# The inplace=True parameter modifies the DataFrame directly without creating a copy
df.rename(columns = {
    'Customer Name' : 'name',
     'Customer Phone': 'phone_number'
},inplace = True)
df # Display the DataFrame with renamed columns

              name  phone_number
0     rafael nadal    4567895647
1  maria sharapova     434534545
2   vladimir putin      89345345
3      kim un jong     123434456
4       jeff bezos     934534543
5     rahul gandhi      44324222

In [96]:
# Save the DataFrame 'df' to a SQL database table named 'customers'
# Using the database connection 'engine'
# Don't include the DataFrame index in the SQL table
# If the table already exists, append the data to it rather than replacing it
df.to_sql(
    name='customers',
    con=engine,
    index=False,
    if_exists='append',
)

6

In [102]:
# Execute SQL query to retrieve distinct customer names from the customers table
# and load the results into a pandas DataFrame
pd.read_sql(" select distinct customers.name , customers.phone_number from customers;",engine)

              name  phone_number
0           Donald    7326784567
1             Bill    6573489999
2             Modi    4567895646
3     rafael nadal    4567895647
4  maria sharapova     434534545
5   vladimir putin      89345345
6      kim un jong     123434456
7       jeff bezos     934534543
8     rahul gandhi      44324222